#### SimplifyCurtainSystems Property

---

|  |
| --- |
| EnergyAnalysisDetailModelOptions Class   See Also |

Indicates if to specify the setting for simplified curtain systems.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool SimplifyCurtainSystems { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SimplifyCurtainSystems As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool SimplifyCurtainSystems { 	bool get (); 	void set (bool value); } ``` |

# Remarks

Curtain Walls and Curtain Systems are normally exported as several openings, panel by panel, while for energy analysis all you need is one giant window. A curtain wall with 50 panels gets exported as 50 openings, while 1 opening with the total opening area would be more appropriate. When this setting is on, one "large" window/opening will be exported for a curtain wall/system

# See Also

EnergyAnalysisDetailModelOptions Class

Autodesk.Revit.DB.Analysis Namespace